Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # module.ollama.helm_release.ollama will be updated in-place
~ resource "helm_release" "ollama" {
      ~ id                         = "ollama" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "0.11.7" -> (known after apply)
          ~ chart          = "ollama" -> (known after apply)
          ~ first_deployed = 1754361333 -> (known after apply)
          ~ last_deployed  = 1758049869 -> (known after apply)
          ~ name           = "ollama" -> (known after apply)
          ~ namespace      = "ollama" -> (known after apply)
          ~ notes          = <<-EOT
                1. Get the application URL by running these commands:
                     NOTE: It may take a few minutes for the LoadBalancer IP to be available.
                           You can watch the status of by running 'kubectl get --namespace ollama svc -w ollama'
                  export SERVICE_IP=$(kubectl get svc --namespace ollama ollama --template "{{ range (index .status.loadBalancer.ingress 0) }}{{.}}{{ end }}")
                  echo http://$SERVICE_IP:11434
            EOT -> (known after apply)
          ~ revision       = 7 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - ollama           = {
                      - gpu = {
                          - enabled = true
                          - number  = 1
                          - type    = "amd"
                        }
                    }
                  - persistentVolume = {
                      - enabled      = true
                      - size         = "32Gi"
                      - storageClass = "local-path"
                    }
                  - resources        = {
                      - limits   = {
                          - cpu = "2000m"
                        }
                      - requests = {
                          - memory = "4096Mi"
                        }
                    }
                  - service          = {
                      - annotations = {
                          - "metallb.universe.tf/loadBalancerIPs" = "10.206.101.10"
                        }
                      - type        = "LoadBalancer"
                    }
                }
            ) -> (known after apply)
          ~ version        = "1.28.0" -> (known after apply)
        } -> (known after apply)
        name                       = "ollama"
      ~ version                    = "1.28.0" -> "1.29.0"
        # (27 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.billv.ca/lock?id=billv-ca%252Fhomelab-atlantis-k3s-services%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```